#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/github/runs/run-AAMJzqPGoeuLprxg

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
github_team.organisation_teams["ReleaseTrain"]: Refreshing state... [id=6372895]
github_team.organisation_teams["Ansible"]: Refreshing state... [id=2454000]
github_team.organisation_teams["Developers"]: Refreshing state... [id=6309608]
github_team.organisation_teams["Azimuth"]: Refreshing state... [id=6372898]
github_team.organisation_teams["OpenStack"]: Refreshing state... [id=6372899]
github_team.organisation_teams["Batch"]: Refreshing state... [id=6372897]
github_team.organisation_teams["SMSLab"]: Refreshing state... [id=6372896]
github_repository.repositories[".github"]: Refreshing state... [id=.github]
data.github_repository.repositories[".github"]: Reading...
github_team_repository.developers_repositories[".github"]: Refreshing state... [id=6309608:.github]
github_team_repository.release_train_repositories[".github"]: Refreshing state... [id=6372895:.github]
github_team_membership.team_membership["Ansible:jackhodgkiss"]: Refreshing state... [id=2454000:jackhodgkiss]
github_team_membership.team_membership["Ansible:GregWhiteyBialas"]: Refreshing state... [id=2454000:GregWhiteyBialas]
github_team_membership.team_membership["Ansible:grzegorzkoper"]: Refreshing state... [id=2454000:grzegorzkoper]
github_team_membership.team_membership["Ansible:m-bull"]: Refreshing state... [id=2454000:m-bull]
github_team_membership.team_membership["Developers:stackhpc-ci"]: Refreshing state... [id=6309608:stackhpc-ci]
github_team_membership.team_membership["Ansible:markgoddard"]: Refreshing state... [id=2454000:markgoddard]
github_team_membership.team_membership["Ansible:bbezak"]: Refreshing state... [id=2454000:bbezak]
github_team_membership.team_membership["Ansible:jovial"]: Refreshing state... [id=2454000:jovial]
github_team_membership.team_membership["Ansible:oneswig"]: Refreshing state... [id=2454000:oneswig]
github_team_membership.team_membership["Developers:jackhodgkiss"]: Refreshing state... [id=6309608:jackhodgkiss]
github_team_membership.team_membership["Ansible:JohnGarbutt"]: Refreshing state... [id=2454000:JohnGarbutt]
github_team_membership.team_membership["Ansible:cityofships"]: Refreshing state... [id=2454000:cityofships]
github_team_membership.team_membership["Ansible:dougszumski"]: Refreshing state... [id=2454000:dougszumski]
github_team_membership.team_membership["Ansible:mnasiadka"]: Refreshing state... [id=2454000:mnasiadka]
data.github_repository.repositories[".github"]: Read complete after 2s [id=.github]
github_team_membership.team_membership["Ansible:g0rgamesh"]: Refreshing state... [id=2454000:g0rgamesh]
github_team_membership.team_membership["Ansible:sjpb"]: Refreshing state... [id=2454000:sjpb]
github_team_membership.team_membership["Ansible:k-s-dean"]: Refreshing state... [id=2454000:k-s-dean]
github_branch_protection.release_train_branch_protection[".github"]: Refreshing state... [id=BPR_kwDOHK-Qcs4BodCX]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # github_team.organisation_teams["Ansible"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"79728b1cc3edefca9cf2d11a5d68ca20bb1d29a93ad26d8c228e6736a7d24ce0\"" -> "W/\"4977b0f32f2a321cac6549113155b6bc0795a1b1094e4a9320b7bff6ca0349a3\""
        id                        = "2454000"
        name                      = "Ansible"
        # (6 unchanged attributes hidden)
    }

  # github_team.organisation_teams["Azimuth"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"559b71a14a2c526dcce2066d1d24596226372c2de794dccd767ff489a5c603b8\"" -> "W/\"ae3647d2cb73b89cdd4233559944863de7d690add3e2e7a111a7d29c55039bd7\""
        id                        = "6372898"
        name                      = "Azimuth"
        # (6 unchanged attributes hidden)
    }

  # github_team.organisation_teams["Batch"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"b074e48e5cf49447f2645f6f4bb1d5fbfd1d5cb6b1904d162d4b16d6e929006b\"" -> "W/\"74d32a7f487bed4fc566d5255ecb045c8e6348770ccdee519a3edc1c4b150ea7\""
        id                        = "6372897"
        name                      = "Batch"
        # (6 unchanged attributes hidden)
    }

  # github_team.organisation_teams["Developers"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"e2f12bbb3e626262471b1f74fa9e01809cb460a2e51619cb82d950d55c2452ef\"" -> "W/\"a823c9bce0288f096c7e36b0fcce2b59398e3ab1d4710d86488739c1eafb1a88\""
        id                        = "6309608"
        name                      = "Developers"
        # (6 unchanged attributes hidden)
    }

  # github_team.organisation_teams["OpenStack"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"ec3d162281acf62eaf9af82e577b099e3a1b1d530a27a0f1d181708f5d157193\"" -> "W/\"115707b0185ad4207bd1678eeaab78bf0938e3241978c67cbaae304acb263c16\""
        id                        = "6372899"
        name                      = "OpenStack"
        # (6 unchanged attributes hidden)
    }

  # github_team.organisation_teams["ReleaseTrain"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"f7e8c6e662d0a4922158317fa157476060e6f8bcac029d32520f8d105d2a92b5\"" -> "W/\"6b0e57566d2e0d50a14c054e85895aaa06be96fc3884ee9e34ef026bae565b13\""
        id                        = "6372895"
        name                      = "ReleaseTrain"
        # (6 unchanged attributes hidden)
    }

  # github_team.organisation_teams["SMSLab"] has changed
  ~ resource "github_team" "organisation_teams" {
      ~ etag                      = "W/\"2e218e0c791ed5396ec97cda301dc75bc13fe1b8aadf6ad35512b1379b7e22fa\"" -> "W/\"4949793be32fcd543cf5bd8b421df159f4f16b707392a19904fc3ca9c27d1c9c\""
        id                        = "6372896"
        name                      = "SMSLab"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_issue_label.community_files_label[".github"] will be created
  + resource "github_issue_label" "community_files_label" {
      + color       = "3F84E5"
      + description = "Community files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "community-files"
      + repository  = ".github"
      + url         = (known after apply)
    }

  # github_issue_label.stackhpc_ci_label[".github"] will be created
  + resource "github_issue_label" "stackhpc_ci_label" {
      + color       = "E6E2C0"
      + description = "Automated action performed by stackhpc-ci"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "stackhpc-ci"
      + repository  = ".github"
      + url         = (known after apply)
    }

  # github_issue_label.workflows_label[".github"] will be created
  + resource "github_issue_label" "workflows_label" {
      + color       = "638475"
      + description = "Workflow files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "workflows"
      + repository  = ".github"
      + url         = (known after apply)
    }

  # github_repository.repositories[".github"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ delete_branch_on_merge = false -> true
        id                     = ".github"
        name                   = ".github"
        # (26 unchanged attributes hidden)
    }

  # github_team.organisation_teams["Kayobe"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for Kayobe development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Kayobe"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.team_membership["Ansible:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "2454000"
      + username = "stackhpc-ci"
    }

  # github_team_membership.team_membership["Azimuth:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6372898"
      + username = "stackhpc-ci"
    }

  # github_team_membership.team_membership["Batch:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6372897"
      + username = "stackhpc-ci"
    }

  # github_team_membership.team_membership["Developers:GregWhiteyBialas"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "GregWhiteyBialas"
    }

  # github_team_membership.team_membership["Developers:JohnGarbutt"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "JohnGarbutt"
    }

  # github_team_membership.team_membership["Developers:bbezak"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "bbezak"
    }

  # github_team_membership.team_membership["Developers:cityofships"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "cityofships"
    }

  # github_team_membership.team_membership["Developers:darmach"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "darmach"
    }

  # github_team_membership.team_membership["Developers:dougszumski"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "dougszumski"
    }

  # github_team_membership.team_membership["Developers:g0rgamesh"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "g0rgamesh"
    }

  # github_team_membership.team_membership["Developers:grzegorzkoper"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "grzegorzkoper"
    }

  # github_team_membership.team_membership["Developers:jcoquillion"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "jcoquillion"
    }

  # github_team_membership.team_membership["Developers:johntaylorsc"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "johntaylorsc"
    }

  # github_team_membership.team_membership["Developers:jovial"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "jovial"
    }

  # github_team_membership.team_membership["Developers:k-s-dean"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "k-s-dean"
    }

  # github_team_membership.team_membership["Developers:m-dull"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "m-dull"
    }

  # github_team_membership.team_membership["Developers:markgoddard"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "markgoddard"
    }

  # github_team_membership.team_membership["Developers:mkjpryor"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "mkjpryor"
    }

  # github_team_membership.team_membership["Developers:mnasiadka"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "mnasiadka"
    }

  # github_team_membership.team_membership["Developers:onewsig"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "onewsig"
    }

  # github_team_membership.team_membership["Developers:priteau"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "priteau"
    }

  # github_team_membership.team_membership["Developers:sjpb"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6309608"
      + username = "sjpb"
    }

  # github_team_membership.team_membership["Developers:stackhpc-ci"] will be updated in-place
  ~ resource "github_team_membership" "team_membership" {
        id       = "6309608:stackhpc-ci"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.team_membership["Kayobe:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "stackhpc-ci"
    }

  # github_team_membership.team_membership["OpenStack:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6372899"
      + username = "stackhpc-ci"
    }

  # github_team_membership.team_membership["ReleaseTrain:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6372895"
      + username = "stackhpc-ci"
    }

  # github_team_membership.team_membership["SMSLab:stackhpc-ci"] will be created
  + resource "github_team_membership" "team_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6372896"
      + username = "stackhpc-ci"
    }

Plan: 30 to add, 2 to change, 0 to destroy.


```

</details>

*Pusher: @jackhodgkiss, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub`*